app/controllers/todo_lists_controller.rb

  def create
    @todo_list = current_user.todo_lists.build(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Noviya"], ["description", "sign up tryyyyy"], ["created_at", "2021-03-08 22:08:48.814480"], ["updated_at", "2021-03-08 22:08:48.814480"], ["user_id", 1]]